/*
 Localized strings for CFErrors returned by AVFoundationCF.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_Description" = "Не удается завершить действие";
"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_RecoverySuggestion" = "Повторите попытку позже.";

"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_Description" = "Невозможно открыть";
"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_FailureReason" = "Этот формат медиафайла не поддерживается.";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_Description" = "Невозможно открыть";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_FailureReason" = "Возможно, этот медиафайл поврежден.";

"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_Description" = "Невозможно открыть";
"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_FailureReason" = "Данное приложение не авторизовано для воспроизведения этого файла."; /* the file is DRM protected */
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_Description" = "Невозможно открыть";
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_FailureReason" = "Невозможно использовать этот медиафайл.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_Description" = "Невозможно декодировать";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_FailureReason" = "Необходимый для данного медиафайла декодер занят.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Остановите все операции, декодирующие медиафайлы, и повторите попытку.";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_Description" = "Невозможно открыть";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_FailureReason" = "Данный медиафайл нельзя использовать на этом компьютере.";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_Description" = "Не удается открыть";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_FailureReason" = "Этот контент не может воспроизводиться на внешнем дисплее.";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_Description" = "Не удается открыть";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_FailureReason" = "Защищенный контент не может воспроизводиться в текущей конфигурации системы.";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_Description" = "В видеодорожке после перекодирования неправильное количество кадров";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_FailureReason" = "Число кадров в результатах перекодирования не равно источнику, в котором нет редактируемых сегментов";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_Description" = "Не удалось декодировать";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_FailureReason" = "ошибка при работе декодера";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_Description" = "Не удалось закодировать";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_FailureReason" = "ошибка при работе кодера";

